examples/dfLowMachFoam/twoDSandiaD_flareFGM/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Set application name
application=$(getApplication)


runApplication blockMesh

runApplication decomposePar -force 

mpirun --oversubscribe -np 4 --allow-run-as-root dfLowMachFoam -parallel

./postProcess
 


#------------------------------------------------------------------------------
