examples/dfLowMachFoam/twoDSandiaD_flareFGM/constant/CanteraTorchProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version          2.0;
    format           ascii;
    class            dictionary;
    location         "constant";
    object           CanteraTorchProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry       off;

CanteraMechanismFile "gri30.yaml";

transportModel       "mixture-averaged";

odeCoeffs
{
    "relTol"         1e-6;
    "absTol"         1e-10;
}

inertSpecie          "N2";

splittingStrategy    off;

TorchSettings
{
    torch            off;
    GPU              off;
    log              off;
    torchModel       ""; 
    coresPerNode     4;
}

loadbalancing
{
    active           true;
    log              false;
    algorithm        allAverage;//headTail;
}


// ************************************************************************* //
