examples/dfLowMachFoam/twoDSandiaD_flareFGM/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     dfLowMachFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1.1;

deltaT          1e-05;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

adjustTimeStep  yes;

maxCo           0.8;

maxAlphaCo      1;

maxDeltaT       1;


// ************************************************************************* //
